Show / Hide Table of Contents
Class ValueCount
Specifies pair of value and their count.
Inheritance
System.Object
ValueCount
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Parameters
Assembly: IdeaRS.OpenModel.dll
Syntax
public sealed class ValueCount
Properties
Improve this Doc   View Source
Count
Gets or sets the repeating of value.
Declaration
public int Count { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Value
Gets or sets the value.
Declaration
public double Value { get; set; }
Property Value
 Type |  Description
 System.Double
Methods
Improve this Doc   View Source
Create(Double)
Creates a new instance with specified value.
Declaration
public static ValueCount Create(double value)
Parameters
 Type |  Name |  Description
 System.Double |  value
The value to set.
Returns
 Type |  Description
 ValueCount
A new instance of ValueCount.
Improve this Doc   View Source
Create(Double, Int32)
Creates a new instance with value and their repeating.
Declaration
public static ValueCount Create(double value, int count)
Parameters
 Type |  Name |  Description
 System.Double |  value
The value to set.
 System.Int32 |  count
The number of repeating.
Returns
 Type |  Description
 ValueCount
A new instance of ValueCount.
 Improve this Doc
 View Source